# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
df = pd.read_csv('/kaggle/input/us-baby-names/US_Baby_Names_right.csv')
df

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

In [3]:
df.info()
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

### Step 4. See the first 10 entries

In [4]:
df.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [5]:
df = df.drop(columns=['Unnamed: 0','Id'])
df

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [6]:
gender_counts = df['Gender'].value_counts()

if gender_counts['M'] > gender_counts['F']:
    result = 'Male'
elif gender_counts['F'] > gender_counts['M']:
    result = 'Female'
else:
    result = 'Equal'

print(f"There are more {result} names in the dataset.")

There are more Female names in the dataset.

In [7]:
df1 = df.groupby(['Gender']).sum(['Count'])
df1

              Year     Count
Gender
F       1122736288  16380293
M        919255329  19041199

In [8]:
gender_count = df['Gender'].value_counts()
print(gender_count)

Gender
F    558846
M    457549
Name: count, dtype: int64

In [9]:
gender_count = df['Gender'].value_counts()
print(gender_count)

if gender_count['F'] > gender_count['M']:
    print("There are more female names in the dataset.")
elif gender_count['F'] < gender_count['M']:
    print("There are more male names in the dataset.")
else:
    print("The number of male and female names in the dataset is equal.")

Gender
F    558846
M    457549
Name: count, dtype: int64
There are more female names in the dataset.

### Step 7. Group the dataset by name and assign to names

In [10]:
names = df.groupby('Name').count()
names

         Year  Gender  State  Count
Name
Aaban       2       2      2      2
Aadan       4       4      4      4
Aadarsh     1       1      1      1
Aaden     196     196    196    196
Aadhav      1       1      1      1
...       ...     ...    ...    ...
Zyra        7       7      7      7
Zyrah       2       2      2      2
Zyren       1       1      1      1
Zyria      10      10     10     10
Zyriah      9       9      9      9

[17632 rows x 4 columns]

### Step 8. How many different names exist in the dataset?

In [11]:
unique_names = df['Name'].nunique()
unique_names

17632

### Step 9. What is the name with most occurrences?

In [12]:
names.Count.idxmax()

'Riley'

In [13]:
name_counts = df['Name'].value_counts()
name_counts

Name
Riley      1112
Avery      1080
Jordan     1073
Peyton     1064
Hayden     1049
           ...
Terryn        1
Yanna         1
Zemirah       1
Emmilyn       1
Coalton       1
Name: count, Length: 17632, dtype: int64

In [14]:
name_counts = df['Name'].value_counts()
name_counts

most_common_name = name_counts.idxmax()
most_common_count = name_counts.max()

print(f"The name with the most occurrences is '{most_common_name}' with {most_common_count} occurrences.")

The name with the most occurrences is 'Riley' with 1112 occurrences.

### Step 10. How many different names have the least occurrences?

In [15]:
names.Count.idxmin()

'Aadarsh'

In [16]:
name_counts = df['Name'].value_counts()
name_counts

min_count = name_counts.min()
names_with_min_count = (name_counts == min_count).sum()

print(f"Number of different names with the least occurrences: {names_with_min_count}")

Number of different names with the least occurrences: 3682

### Step 11. What is the median name occurrence?

In [17]:
name_counts = df['Name'].value_counts()

median_occurrence = name_counts.median()

print(f"The median number of occurrences for names is: {median_occurrence}")

The median number of occurrences for names is: 8.0

In [18]:
names.Count.median()

8.0

### Step 12. What is the standard deviation of names?

In [19]:
names.Count.std().round(2)

122.03

In [20]:
name_counts = df['Name'].value_counts()

std_deviation = name_counts.std()
rounded_std_deviation = round(std_deviation, 2)

print(f"The standard deviation of the number of occurrences for names is: {rounded_std_deviation}")

The standard deviation of the number of occurrences for names is: 122.03

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [21]:
names.describe().round(2)

           Year    Gender     State     Count
count  17632.00  17632.00  17632.00  17632.00
mean      57.64     57.64     57.64     57.64
std      122.03    122.03    122.03    122.03
min        1.00      1.00      1.00      1.00
25%        2.00      2.00      2.00      2.00
50%        8.00      8.00      8.00      8.00
75%       39.00     39.00     39.00     39.00
max     1112.00   1112.00   1112.00   1112.00

In [22]:
name_counts = df['Name'].value_counts()

summary = {
    'Mean': name_counts.mean(),
    'Min': name_counts.min(),
    'Max': name_counts.max(),
    'Std': name_counts.std(),
    '25th Percentile': name_counts.quantile(0.25),
    '50th Percentile (Median)': name_counts.median(),
    '75th Percentile': name_counts.quantile(0.75)
}

print("Summary of name occurrences:")
for stat, value in summary.items():
    print(f"{stat}: {value:.2f}")

Summary of name occurrences:
Mean: 57.64
Min: 1.00
Max: 1112.00
Std: 122.03
25th Percentile: 2.00
50th Percentile (Median): 8.00
75th Percentile: 39.00